---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintRotX
source: html/485998bf-8f4d-7cb8-16cc-1322a57c7312.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryLinearRestraintRotX Property

"X Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryLinearRestraintRotX { get; }
```